import React from 'react'

export default function Cards() {
    
const articleHandler = (data)=>{
    switch(data.type){
    case 'paragraph' : return <p>{data.text}</p>;
    case 'list' : return (<ul className='u-list'> {data.items.map(item=>(<li>{item}</li>))}</ul>);
    }
}

        return(
            <>
             { data.map(data=>(
<div className='card' id={data.id}>
            <div>
             <span className='card__title'>{data.title}</span>
             {
                 data.article.map(data=>(
                 <span className='card__desc'>{articleHandler(data)}</span>
                 ))
             }
            
            </div>
        </div>
            ))
        }
            </>
        )
          
        
    
}



const data = [
    {   
        id:'section1',
        title:'مهمتنا',
        article: [
            {
                type:'paragraph',
                text:'تعمل شركة انجاز من خلال كوادرها والتكنولوجيا الموظفة فيها على تبسيط إجراءات جميع تعاملات مستخدمي الخدمات الحكومية وغير الحكومية ومجهزي هذه الخدمات بما يضمن الرفاهية والسهولة والأمان،'
            },
            {
                type:'paragraph',
                text:'كما تسعى انجاز على صعيد اخر الى نقل المعرفة الى الجيل القادم بما يمكنه من دخول سوق العمل بشكل كفوء ليكون المساهم الحقيقي في رسم الصفحة الجديدة للعراق، هذا من خلال مزج المعرفة الاكاديمية التي تمنحها المدرسة والجامعة ومتطلبات سوق العمل مما يوفر الاف الفرص لشريحة الشباب'
            }

        ]
    },
    {
        id:'section2',
        title:'رسالتنا',
        article: [
            {
                type:'paragraph',
                text:'تتخذ شركة إنجاز على عاتقها مهمات عديدة ساعية أن تغطي حجم التطور الهائل الرقمي والإلكتروني في العالم. وأهم ما تقدمه الشركة من خدمات.'
            },
            {
                type:'list',
                items:[
                    'بناء منصة الكترونية شاملة تقدم مجموعة من الخدمات الإلكترونية التي تسهل حياة المواطن العراقي.',
                    'تطوير حلول مؤسساتية قادرة على أتمتة جميع أنواع المعاملات الحكومية.',
                    ' ربط العراق بمجموعة من البوابات الإلكترونية واستخدام الخوادم المُخصصة لها سعيا لتسهيل الولوج إلى البوابات الإلكترونية العالمية.',
                    ' تقوم الشركة على تطوير البيانات وتأسيس بُنى تحتية الكترونية ورقمية تساعد المُستخدم تسهيل المعاملات وباقي الخدمات الإلكترونية.'
                ]
            }

        ]
    },
    {
        id:'section3',
        title:'اهدافنا',
        article: [
            {
                type:'paragraph',
                text:'يمكن لشركة إنجاز أن تكون لها اليد الطولى في الدوائر الخدمية التي تعتمد على البوابات الإلكترونية والخوادم حيث يمكنها توفير هذه الخدمة من خلال كادرها المُتخصص والمُتمرس في تكنولوجيا المعلومات.'
            },
            {
                type:'paragraph',
                text:'كما تولي شركة إنجاز لتطوير البرمجيات أهمية بالغة في تقديم المعالجات البرمجية لبرامج الحاسوب وحمايتها من الضرر في وقت قياسي وبطريقة آمنة تخلو من العيوب والثغرات.'
            },
            {
                type:'list',
                items:[
                    'تعمل الشركة على ربط العراق الكترونيا ً ورقميا ً من خلال تعاملها وتعاونها مع الجهات المعنية والشركات والمكاتب المتخصصة وذلك من خلال فريق يمتلك الخبرة والكفاءة.',
                    'تحرص شركة إنجاز على توفير الخدمات الحاسوبية والرقمية لمستخدميها وعملائها وإبراز الجانب الإبداعي في العالم الرقمي.'
                ]
            }
        ]
},
{
    id:'section4',
    title:'السياسة العامة',
    article: [
        {
            type:'paragraph',
            text:'ينصب اهتمام شركة إنجاز على أن تكون واحدة من الشركات البارزة في العراق من خلال الخدمات المُتميزة التي تقدمها حيث تحاول أن تساهم في تكبير قاعدة الإستخدام الإلكتروني داخل القُطر وخارجه.'
        },
        {
            type:'paragraph',
            text:'واحدة من الأهداف التي تحاول شركة إنجاز الوصول لها هي ترك بصمة في مجال تكنولوجيا المعلومات وذلك من خلال تأسيس مواقع ونوافذ وخوادم بتبادل الكتروني متميز يضعها في مصاف شركات البرمجيات المُطوّرة على مستوى المنطقة.'
        },
        {
            type:'paragraph',
            text:'كما تسعى الشركة إلى توفير خدمات الكترونية ميسرة ومتطورة تساهم في تعزيز تكنولوجيا المعلومات في العراق والعالم العربي. وتحرص الشركة على إدامة الحوار والتواصل مع الشركات العربية والدولية من أجل ربط العراق بكل ما يحصل من تحديثات وثورات رقمية و طفرات تكنولوجية الكترونية مواكبة بذلك ركب العالم الالكتروني.'
        },
        {
            type:'paragraph',
            text:'كما إن الشركة تعمل ليل نهار على تدعيم تواجدها في السوق المحلي كشركة متخصصة في تطوير البرمجيات وجعل اسمها متداولا ً في السوق لخلق سمعة طيبة وموثوق بها على الصعيد المحلي والعربي.'
        },
    ]
}
]
